Repository: sugar-activities/4593-activity
Catalog: po/*.po
Languages: mi

source: SimpleGNUChess
mi: WhaikīngiGNUMataiti

source: Edit
mi: Whakatika

source: View
mi: Tiro

source: Adjust
mi: Whakarite

source: Custom
mi: Ritenga

source: Play
mi: Tākaro

source: Copy
mi: Tārua

source: Paste
mi: Whakapiri

source: Fullscreen
mi: Matakatoa

source: Play game history
mi: Hītori pūrei tākaro

source: Show game history
mi: Whakaatu hītori tākaro

source: White:
mi: Mā:

source: White's move
mi: Te wā o Mā

source: Black:
mi: Pango:

source: Black's move
mi: Te wā o Pango

source: Default pieces
mi: Pīhi taunoa

source: Sugar-style pieces
mi: Pīhi āhua-Sugar

source: Custom pieces
mi: Pīhi ritenga

source: Play White
mi: Tākaro Mā

source: Play Black
mi: Tākaro Pango

source: Beginner
mi: Tauhou

source: Expert
mi: Tohunga

source: Play against the computer
mi: Tākaro me te rorohiko

source: Play against a person
mi: Tākaro me tētahi tangata

source: New game
mi: Tākaro hōu

source: Undo
mi: Wete

source: Hint
mi: Tīwhiri

source: It is White's move.
mi: Kei a Mā te wā.

source: White Pawn
mi: Kaihāpai-ō Mā

source: Black Pawn
mi: Kaihāpai-ō Pango

source: White Rook
mi: Pā Tūwatawata Mā

source: Black Rook
mi: Pā Tūwatawata Pango

source: White Knight
mi: Toa Mā

source: Black Knight
mi: Toa Pango

source: White Bishop
mi: Pīhopa Mā

source: Black Bishop
mi: Pīhopa Pango

source: White Queen
mi: Kūini Mā

source: Black Queen
mi: Kūini Pango

source: White King
mi: Kīngi Mā

source: Black King
mi: Kīngi Pango

source: Show game board
mi: Whakaatu papa tākaro

source: Game in progress.
mi: E haere ana te tākaro.

source: Do you want to start a new game?
mi: E hiahia ana koe ki te tīmata i tētahi tākaro hōu?

source: Illegal move
mi: Nekehanga hē

source: Check
mi: Tieke

source: Checkmate
mi: Whakamīere

source: It is Black's move.
mi: Kei a Pango te wā.

source: Black wins.
mi: Ka toa a Pango.

source: White wins.
mi: Ka toa a Mā.

source: White's King is in check.
mi: Kua tieke te Kīngi Mā.

source: Black's King is in check.
mi: Kua tieke te Kīngi Pango.

source: Please wait for your turn.
mi: Taihoa koa, kia tae ki tō wā.

source: Please play White.
mi: Tākaro koa Mā.

source: Please play Black.
mi: Tākaro koa Pango.

source: Thinking...
mi: Whakaaro ana...

source: Thinking
mi: Whakaaro ana
